conductor_data = {
    0.5: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 0.5,
        "导体结构 mm": "28/0.15",
        "单线偏差 mm": "0.15+0.002",
        "纹线外径 mm": 0.92,
        "铜消耗 kg/km": 4.5
    },
    0.75: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 0.75,
        "导体结构 mm": "41/0.15",
        "单线偏差 mm": "0.15+0.002",
        "纹线外径 mm": 1.13,
        "铜消耗 kg/km": 6.5
    },
    1: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 1,
        "导体结构 mm": "32/0.195",
        "单线偏差 mm": "0.195±0.002",
        "纹线外径 mm": 1.29,
        "铜消耗 kg/km": 8.6
    },
    1.5: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 1.5,
        "导体结构 mm": "47/0.195",
        "单线偏差 mm": "0.195±0.002",
        "纹线外径 mm": 1.57,
        "铜消耗 kg/km": 12.6
    },
    2.5: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 2.5,
        "导体结构 mm": "76/0.195",
        "单线偏差 mm": "0.195±0.002",
        "纹线外径 mm": 2.00,
        "铜消耗 kg/km": 20.4
    },
    4: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 4,
        "导体结构 mm": "54/0.295",
        "单线偏差 mm": "0.295±0.002",
        "纹线外径 mm": 2.55,
        "铜消耗 kg/km": 33.2
    },
    6: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 6,
        "导体结构 mm": "80/0.295 8+6股×12支",
        "单线偏差 mm": "0.295±0.002",
        "纹线外径 mm": 3.42,
        "铜消耗 kg/km": 49.2
    },
    10: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 10,
        "导体结构 mm": "80/0.395 8+6股×12支",
        "单线偏差 mm": "0.395±0.002",
        "纹线外径 mm": 4.49,
        "铜消耗 kg/km": 88.2
    },
    16: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 16,
        "导体结构 mm": "126/0.40",
        "单线偏差 mm": "±0.004",
        "纹线外径 mm": 5.90,
        "铜消耗 kg/km": 145
    },
    25: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 25,
        "导体结构 mm": "196/0.40",
        "单线偏差 mm": "±0.004",
        "纹线外径 mm": 7.28,
        "铜消耗 kg/km": 226
    },
    35: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 35,
        "导体结构 mm": "276/0.40",
        "单线偏差 mm": "±0.004",
        "纹线外径 mm": 9.31,
        "铜消耗 kg/km": 318
    },
    50: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 50,
        "导体结构 mm": "396/0.40",
        "单线偏差 mm": "±0.004",
        "纹线外径 mm": 10.13,
        "铜消耗 kg/km": 456
    },
    70: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 70,
        "导体结构 mm": "360/0.50",
        "单线偏差 mm": "±0.004",
        "纹线外径 mm": 12.12,
        "铜消耗 kg/km": 648
    },
    95: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 95,
        "导体结构 mm": "475/0.50",
        "单线偏差 mm": "±0.005",
        "纹线外径 mm": 14.00,
        "铜消耗 kg/km": 855
    },
    120: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 120,
        "导体结构 mm": "608/0.50",
        "单线偏差 mm": "±0.005",
        "纹线外径 mm": 15.24,
        "铜消耗 kg/km": 1093
    },
    150: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 150,
        "导体结构 mm": "760/0.50",
        "单线偏差 mm": "±0.005",
        "纹线外径 mm": 18.25,
        "铜消耗 kg/km": 1357
    },
    185: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 185,
        "导体结构 mm": "931/0.50",
        "单线偏差 mm": "±0.005",
        "纹线外径 mm": 19.14,
        "铜消耗 kg/km": 1674
    },
    240: {
        "导体名称": "5类导体",
        "截面尺寸 mm²": 240,
        "导体结构 mm": "1216/0.50",
        "单线偏差 mm": "±0.005",
        "纹线外径 mm": 22.07,
        "铜消耗 kg/km": 2183
    }
}

conductor_diameter = {
    0.5: {
        "第1种导体": 0.8,
        "第2种导体": 0.9,
        "第5种导体": 1.0
    },
    0.75: {
        "第1种导体": 1.0,
        "第2种导体": 1.1,
        "第5种导体": 1.1
    },
    1.0: {
        "第1种导体": 1.1,
        "第2种导体": 1.2,
        "第5种导体": 1.3
    },
    1.5: {
        "第1种导体": 1.4,
        "第2种导体": 1.5,
        "第5种导体": 1.5
    },
    2.5: {
        "第1种导体": 1.8,
        "第2种导体": 1.9,
        "第5种导体": 2.0
    },
    4: {
        "第1种导体": 2.2,
        "第2种导体": 2.4,
        "第5种导体": 2.5
    },
    6: {
        "第1种导体": 2.7,
        "第2种导体": 2.9,
        "第5种导体": 3.0
    },
    10: {
        "第1种导体": 3.5,
        "第2种导体": 3.8,
        "第5种导体": 3.9
    }
}
